require_relative 'lib/game.rb'
require_relative 'lib/bank.rb'
require_relative 'lib/dealer.rb'
require_relative 'lib/user.rb'

class Main 

  def start 
    blackjack
    greetings
  end

  private

  def greetings
    puts "Добро пожаовать!"
    print "Представьтесь пожалуйста: "
    name = gets.chomp
    puts "Здравствуйте #{name}, ну что же, давайте начнем!"
  end

  def blackjack
    puts "
    ██████╗░██╗░░░░░░█████╗░░█████╗░██╗░░██╗░░░░░██╗░█████╗░░█████╗░██╗░░██╗
    ██╔══██╗██║░░░░░██╔══██╗██╔══██╗██║░██╔╝░░░░░██║██╔══██╗██╔══██╗██║░██╔╝
    ██████╦╝██║░░░░░███████║██║░░╚═╝█████═╝░░░░░░██║███████║██║░░╚═╝█████═╝░
    ██╔══██╗██║░░░░░██╔══██║██║░░██╗██╔═██╗░██╗░░██║██╔══██║██║░░██╗██╔═██╗░
    ██████╦╝███████╗██║░░██║╚█████╔╝██║░╚██╗╚█████╔╝██║░░██║╚█████╔╝██║░╚██╗
    ╚═════╝░╚══════╝╚═╝░░╚═╝░╚════╝░╚═╝░░╚═╝░╚════╝░╚═╝░░╚═╝░╚════╝░╚═╝░░╚═╝"
  end
end

Main.new.start
